app/views/users/show.html.erb

<%# if @user.admin == false %>
<% @reservations = Reservation.where(user_id: @user.id) %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 163]]