app/views/reservations/new.html.erb

SELECT DISTINCT "tables".* FROM "tables" WHERE "tables"."restaurant_id" = ? GROUP BY "tables"."capacity"  [["restaurant_id", 63]]
---
  <%= label_tag "Table for people" %>
  <%= select_tag "people", options_for_select(Table.where(restaurant_id: params["restaurant_id"]).group(:capacity).uniq.map { |f| [f.capacity]}) %>