app/views/restaurants/index.html.erb

<% if session["user_id"].present? %>
  <% u = User.find_by(id: session["user_id"]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 161], ["LIMIT", 1]]


  <% restcount = Restaurant.count/10 %>
---
SELECT "restaurants".* FROM "restaurants"