app/views/restaurants/show.html.erb


<!--  <% @rest = Restaurant.find_by(id: params["id"]) %> -->
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

<% if session["user_id"].present? %>
  <% u = User.find_by(id: session["user_id"]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 161], ["LIMIT", 1]]

    <p><%= link_to "Edit", "/restaurants/#{@rest.id}/edit", class: 'btn btn-default' %></p>
    <p><%= link_to "#{Reservation.where(restaurant_id: @rest.id).count} reservations", "/reservations?restaurant_id=#{@rest.id}" %></p>
---
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."restaurant_id" = ?  [["restaurant_id", 63]]


<p><%= link_to "#{Review.where(restaurant_id: @rest.id).count} reviews", "/reviews?restaurant_id=#{@rest.id}" %></p>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 63]]