app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? ORDER BY dine_at desc  [["user_id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" ORDER BY dine_at DESC
---
  def index
    if session["user_id"].present?
      @reservations = Reservation.where(user_id: session["user_id"]).order("dine_at DESC")
      if User.find_by(id: session["user_id"]).admin == true
        @reservations = Reservation.all.order("dine_at DESC")

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 161], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."restaurant_id" = ? ORDER BY dine_at DESC  [["restaurant_id", 63]]
---
  def show
    if session["user_id"].present?
      @reservations = Reservation.where(user_id: session["user_id"]).order("dine_at DESC")
      if User.find_by(id: session["user_id"]).admin == true
        @reservations = Reservation.where(restaurant_id: cookies["rest_id"]).order("dine_at DESC")

INSERT INTO "reservations" ("restaurant_id", "user_id", "reserve_at", "dine_at") VALUES (?, ?, ?, ?)  [["restaurant_id", 63], ["user_id", 161], ["reserve_at", 2017-05-21 04:21:52 UTC], ["dine_at", 2017-01-06 23:21:00 UTC]]
---
  def create
    if session["user_id"].present?
      @reservation = Reservation.new
      @reservation.user_id = session["user_id"]
      @reservation.restaurant_id = cookies["rest_id"]
      @reservation.dine_at = params["dine_at"]
      @reservation.reserve_at = Time.now.utc.to_s(:db)

      if @reservation.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 67], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 67]]
---
  def destroy
    @reservation = Reservation.find_by(id: params["id"])
    @reservation.delete