app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 14]]
---
  def index
    @reservations = Reservation.where(user_id: cookies["user_id"])