app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @rest = Restaurant.find_by(id: params["id"])

SELECT  "restaurants".* FROM "restaurants" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    # @restaurants = Restaurant.all
    @restaurants = Restaurant.page(params["page"]).per(10)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 161], ["LIMIT", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]
---
  def edit
    if session["user_id"].present?
      if User.find_by(id: session["user_id"]).admin == false
        redirect_to "/restaurants/#{params["id"]}", notice: "Sorry, you must be an administrator to edit the restaurant information."
      end
    else
      redirect_to "/", notice: "Please sign in first."
    end

    @rest = Restaurant.find_by(id: params["id"])

INSERT INTO "restaurants" ("name", "address", "table_number") VALUES (?, ?, ?)  [["name", "Apple bee"], ["address", "1234 St."], ["table_number", 10]]
---
  def create
    @rest = Restaurant.new
    @rest.name = params["name"]
    @rest.address = params["address"]
    @rest.table_number = params["table_number"]

    if @rest.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]
UPDATE "restaurants" SET "address" = ? WHERE "restaurants"."id" = ?  [["address", "1518 E 53rd St., Chicago, IL, 60615"], ["id", 63]]
---
  def update
    @rest = Restaurant.find_by(id: params["id"])
    @rest.name = params["name"]
    @rest.address = params["address"]
    @rest.table_number = params["table_number"]

    if @rest.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 70], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 70]]
---
  def destroy
    @rest = Restaurant.find_by(id: params["id"])
    @rest.delete