app/controllers/reviews_controller.rb

  def show
    if session["user_id"].present?
      @review = Review.find_by(id: params["id"])
      if session["user_id"] != @review.user_id
        redirect_to "/reviews/#{@review.id}", notice: "Sorry, you cannot edit this review."
      else
        @rest = Restaurant.find_by(id: @review.restaurant_id)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 161], ["LIMIT", 1]]

  def index
    # @restaurants = Restaurant.all
    if params["restaurant_id"] != nil
      @reviews = Review.where(restaurant_id: params["restaurant_id"]).order("updated_at DESC").page(params["page"]).per(10)
    elsif session["user_id"].present?
      @reviews = Review.where(user_id: session["user_id"]).order("updated_at DESC").page(params["page"]).per(10)
    else
      @reviews = Review.all.order("updated_at DESC").page(params["page"]).per(10)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ? ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["restaurant_id", 63], ["LIMIT", 10], ["OFFSET", 0]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["user_id", 161], ["LIMIT", 10], ["OFFSET", 0]]
SELECT  "reviews".* FROM "reviews" ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def edit
    if session["user_id"].blank?
      redirect_to "/", notice: "Please sign in first."
    else
      @review = Review.find_by(id: params["id"])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def update
    @review = Review.find_by(id: params["id"])
    if session["user_id"] != @review.user_id
      redirect_to "/reviews/#{@review.id}", notice: "Sorry, you cannot edit this review."
    end
    @review.restaurant_id = @review.restaurant_id
    @review.content = params["content"]
    @review.updated_at = Time.current.utc.to_s
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "reviews" SET "content" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["content", "Yummy! Hin"], ["updated_at", 2017-05-21 06:45:06 UTC], ["id", 19]]

  def destroy
    if session["user_id"].present?
      @review = Review.find_by(id: params["id"])
      if session["user_id"] != @review.user_id
        redirect_to "/reviews/#{@review.id}", notice: "Sorry, you cannot delete this review."
      else
      # notice: "Review deleted."
        @review.delete
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 19]]