app/controllers/users_controller.rb

  def edit
    if session["user_id"].present?
      @user = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 161], ["LIMIT", 1]]

  def show
    if session["user_id"].present?
      @user = User.find_by(id: params["id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 161], ["LIMIT", 1]]

  def create
    @user = User.new
    @user.name = params["name"]
    @user.password = params["password"]
    @user.points = 0
    @user.email = params["email"]
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "points") VALUES (?, ?, ?, ?)  [["name", "Snow white"], ["email", "snowwhite@tinytable.com"], ["password_digest", "$2a$10$qiSS3KEZSAmIXgxybuaCjOkIH.w.6XnuuDh.Xc0H.ykT0b07xcPH6"], ["points", 0]]

  def update
    if session["user_id"].present?
      @user = User.find_by(id: params["id"])
      if @user.id != session["user_id"]
        redirect_to "/", notice: "Sorry, you cannot edit this account!"
      else
        if @user.authenticate(params["password"])
          @user.name = params["name"]
          @user.email = params["email"]
          change_pswd = params["changed_pswd"]
          if change_pswd == ""
            @user.password = params["password"]
          else
            @user.password = params["changed_pswd"]
          end

          if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 161], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "email" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$2SiMKXRN2co7OucDL4zB4.e2iUQl46K4PgbeGDV1N014sL71P4JO."], ["email", "justi1n@tinytable.com"], ["id", 161]]