app/views/reviews/index.html.erb

      <% @reviews.each do |review| %>
        <%restaurant = Restaurant.find_by(id: review.restaurant_id) %>
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]