app/views/reviews/show.html.erb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 67], ["LIMIT", 1]]
---

<% rest = Restaurant.find_by(id: @review.restaurant_id) %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 161], ["LIMIT", 1]]
---
<% if session["user_id"].present? %>
  <% u = User.find_by(id: session["user_id"]) %>